In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("C:/dev/SQLdemo/Efreq.csv", keep_default_na=False)
# the parameter keep_default_na is very important to deactivate the default consideration of any string valued 'null' or 'nan' as a missing value.

In [4]:
df.columns = ['Word', 'Count']

In [5]:
word_list = df['Word']

In [6]:
df2 = pd.read_csv("C:/dev/SQLdemo/words.txt", keep_default_na=False, sep='\0', header=None)
# from https://github.com/dwyl/english-words

In [7]:
df2

               0
0              2
1           1080
2             &c
3       10-point
4           10th
...          ...
466545    Zwolle
466546  Zworykin
466547        ZZ
466548       zZt
466549       ZZZ

[466550 rows x 1 columns]

In [8]:
df.count()

Word     333333
Count    333333
dtype: int64

In [9]:
df2.count()

0    466550
dtype: int64

In [10]:
df[pd.isna(word_list)]

Empty DataFrame
Columns: [Word, Count]
Index: []

In [11]:
df2[pd.isna(df2[0])]

Empty DataFrame
Columns: [0]
Index: []

In [12]:
pd.isna(word_list)

0         False
1         False
2         False
3         False
4         False
          ...
333328    False
333329    False
333330    False
333331    False
333332    False
Name: Word, Length: 333333, dtype: bool

In [13]:
word_list[2577]

'null'

In [14]:
type(word_list[2577])

str

In [15]:
word_list[2576]

'height'

In [16]:
type(word_list[2576])

str

In [17]:
word_list[12819]

'nan'

In [18]:
type(word_list[12819])

str

In [19]:
word_list.str.contains(',', regex=False)

0         False
1         False
2         False
3         False
4         False
          ...
333328    False
333329    False
333330    False
333331    False
333332    False
Name: Word, Length: 333333, dtype: bool

In [20]:
ws= word_list[word_list.str.contains("'", regex=False)]
ws

Series([], Name: Word, dtype: object)

In [21]:
s = df2[0]

In [ ]:
s[s.str.contains("", regex=False)]

In [47]:
targeted = s[s.str.contains("'", regex=False)]

In [48]:
targeted

37                   a'
130       Aaron's-beard
138              A'asia
334             abbey's
357             abbot's
              ...
464698              x's
465117          zebra's
466322            zoo's
466446              z's
466489        Zu'lkadah
Name: 0, Length: 4215, dtype: object

In [49]:
targeted = targeted.str.replace("'", '', regex=False)

In [50]:
targeted.tail(50)

459621                wifes
459685                 wigs
459747             wildcats
460009      will-o-the-wisp
460011      willo-the-wispy
460012    willo-the-wispish
460036              willows
460338            windmills
460371              windows
460681              winners
461004             wiretaps
461194                wisps
461255        witches-besom
461256        witches-broom
461324          withdrawals
461472                 wits
461564              wizards
461816           wolfs-bane
461822           wolfs-head
461825            wolfsmilk
461934               womans
461956                wombs
461964               womens
462072                 wont
462135           woodchucks
462140            woodcocks
462288          woodpeckers
462663                words
462705           workbenchs
462710            workbooks
462737           workhorses
462792            workshops
463105               worlds
463453              wouldnt
463578             wrappers
463587                wraps
463698                wrens
463856               wrists
463859          wristwatchs
463882              writers
463911                writs
463978              wrongun
464005                   ws
464043         Wu-lu-mu-chi
464589                 xing
464698                   xs
465117               zebras
466322                 zoos
466446                   zs
466489             Zulkadah
Name: 0, dtype: object

In [27]:
display(targeted.head(100))

37                 a'
130     Aaron's-beard
138            A'asia
334           abbey's
357           abbot's
            ...
6243       affinity's
6252    affirmation's
6294     affliction's
6661      afternoon's
6990         agency's
Name: 0, Length: 100, dtype: object

In [51]:
mask = word_list.isin(targeted)
mask

0         False
1         False
2         False
3         False
4          True
          ...
333328    False
333329    False
333330    False
333331    False
333332    False
Name: Word, Length: 333333, dtype: bool

In [52]:
word_list[mask]

4                  a
7                 is
13                 i
22                as
34                us
             ...
326912    bandwagons
330775       canarys
330983      turmoils
331051       busboys
332003      montanas
Name: Word, Length: 3299, dtype: object

In [53]:
droppable = word_list[mask]

In [55]:
droppable.head(50)

4                 a
7                is
13                i
22               as
34               us
87             were
89                s
94              its
119              re
127        products
139               t
156            well
157               d
166               m
171           years
176           items
203            days
230          hotels
251          states
289           pages
305         members
312         systems
326       resources
357        students
368          events
406          movies
414            jobs
444           sales
453         windows
454          photos
490          forums
495             say
511        articles
520           users
543        programs
564         options
583           girls
594              ca
622           files
639           areas
646        problems
679       computers
711          months
714         friends
719            cars
720        messages
746            arts
752       solutions
801           miles
805    applications
Name: Word, dtype: object

In [56]:
droppable.index

Index([     4,      7,     13,     22,     34,     87,     89,     94,    119,
          127,
       ...
       317700, 317780, 318332, 321788, 322310, 326912, 330775, 330983, 331051,
       332003],
      dtype='int64', length=3299)

In [77]:
type(droppable.index)

pandas.core.indexes.base.Index

In [72]:
df.loc[mask]

              Word       Count
4                a  9081174698
7               is  4705743816
13               i  3086225277
22              as  2247431740
34              us  1229112622
...            ...         ...
326912  bandwagons       13029
330775     canarys       12790
330983    turmoils       12778
331051     busboys       12775
332003    montanas       12733

[3299 rows x 2 columns]

In [78]:
df.drop(droppable.index)

           Word        Count
0           the  23135851162
1            of  13151942776
2           and  12997637966
3            to  12136980858
5            in   8469404971
...         ...          ...
333328    gooek        12711
333329   gooddg        12711
333330  gooblle        12711
333331   gollgo        12711
333332    golgw        12711

[330034 rows x 2 columns]

In [80]:
cleaned_df = df.drop(droppable.index)

In [81]:
df

           Word        Count
0           the  23135851162
1            of  13151942776
2           and  12997637966
3            to  12136980858
4             a   9081174698
...         ...          ...
333328    gooek        12711
333329   gooddg        12711
333330  gooblle        12711
333331   gollgo        12711
333332    golgw        12711

[333333 rows x 2 columns]

In [82]:
cleaned_df

           Word        Count
0           the  23135851162
1            of  13151942776
2           and  12997637966
3            to  12136980858
5            in   8469404971
...         ...          ...
333328    gooek        12711
333329   gooddg        12711
333330  gooblle        12711
333331   gollgo        12711
333332    golgw        12711

[330034 rows x 2 columns]

In [84]:
cleaned_df.to_csv('out.csv', index=False)

In [91]:
cleaned_df[cleaned_df['Word'].str.contains("you've" ,regex=False)]

Empty DataFrame
Columns: [Word, Count]
Index: []